import TabularTypeInterpreter.Semantics.Type
import TabularTypeInterpreter.Syntax.InstanceEnvironment
import TabularTypeInterpreter.Syntax.Term

namespace TabularTypeInterpreter

open «F⊗⊕ω»

-- TODO: How should we make it clear that these are fixed values in the latex presentation?

abbrev ℓₘ := 0

abbrev ℓᵣ := 1

judgement_syntax Γᵢ "; " Γc "; " Γ " ⊢ " M " : " σ " ⇝ " E : Term.TypingAndElaboration

judgement_syntax Γᵢ "; " Γc "; " Γ " ⊨ " ψ " ⇝ " E : Monotype.ConstraintSolvingAndElaboration

mutual

judgement Term.TypingAndElaboration :=

x : σ ∈ Γ
───────────────────── var
Γᵢ; Γc; Γ ⊢ x : σ ⇝ x

∀ x ∉ I, Γᵢ; Γc; Γ, x : τ₀ ⊢ M^x : τ₁ ⇝ E^x
Γc; Γ ⊢ τ₀ : * ⇝ A
─────────────────────────────────────────── lam (I : List TermVarId)
Γᵢ; Γc; Γ ⊢ λ x. M : τ₀ → τ₁ ⇝ λ x : A. E

Γᵢ; Γc; Γ ⊢ M : τ₀ → τ₁ ⇝ F
Γᵢ; Γc; Γ ⊢ «N» : τ₀ ⇝ E
──────────────────────────── app
Γᵢ; Γc; Γ ⊢ M «N» : τ₁ ⇝ F E

Γc; Γ ⊢ ψ : C ⇝ A
∀ x ∉ I, Γᵢ; Γc; Γ, ψ ⇝ x ⊢ M^x : γ ⇝ E^x
───────────────────────────────────────── qualI (I : List TermVarId)
Γᵢ; Γc; Γ ⊢ M : ψ ⇒ γ ⇝ λ x : A. E

Γᵢ; Γc; Γ ⊨ ψ ⇝ E
Γᵢ; Γc; Γ ⊢ M : ψ ⇒ γ ⇝ F
───────────────────────── qualE
Γᵢ; Γc; Γ ⊢ M : γ ⇝ F E

∀ a ∉ I, Γᵢ; Γc; Γ, a : κ ⊢ M^a : σ^a ⇝ E^a
⊢ κ ⇝ K
─────────────────────────────────────────── schemeI (I : List TypeVarId)
Γᵢ; Γc; Γ ⊢ M : ∀ a : κ. σ ⇝ Λ a : K. E

Γᵢ; Γc; Γ ⊢ M : ∀ a : κ. σ ⇝ E
Γc; Γ ⊢ τ : κ ⇝ A
────────────────────────────── schemeE
Γᵢ; Γc; Γ ⊢ M : σ^^τ ⇝ E [A]

Γᵢ; Γc; Γ ⊢ M : σ₀ ⇝ E
Γc; Γ ⊢ σ₀ : * ⇝ A
∀ x ∉ I, Γᵢ; Γc; Γ, x : σ₀ ⊢ «N»^x : σ₁ ⇝ F^x
─────────────────────────────────────────────────────── «let» (I : List TermVarId)
Γᵢ; Γc; Γ ⊢ let x : σ₀ = M in «N» : σ₁ ⇝ ⦅λ x : A. F⦆ E

Γᵢ; Γc; Γ ⊢ M : σ ⇝ E
────────────────────────── annot
Γᵢ; Γc; Γ ⊢ M :' σ : σ ⇝ E

──────────────────────── label
Γᵢ; Γc; Γ ⊢ ℓ : ⌊ℓ⌋ ⇝ ()

</ Γᵢ; Γc; Γ ⊢ M@i : ⌊ξ@i⌋ ⇝ F@i // i in [:n] />
unique(</ ξ@i // i in [:n] />)
</ Γᵢ; Γc; Γ ⊢ «N»@i : τ@i ⇝ E@i // i in [:n] />
Γc; Γ ⊢ μ : U ⇝ A
n ≠ 0 ∨ b
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── prod
Γᵢ; Γc; Γ ⊢ {</ M@i ▹ «N»@i // i in [:n] />} : Π(μ) ⟨</ ξ@i ▹ τ@i // i in [:n] /> </ : * // b />⟩ ⇝ (</ E@i // i in [:n] />)

Γᵢ; Γc; Γ ⊢ M : ⌊ξ⌋ ⇝ F
Γᵢ; Γc; Γ ⊢ «N» : τ ⇝ E
Γc; Γ ⊢ μ : U ⇝ A
──────────────────────────────────────────── sum
Γᵢ; Γc; Γ ⊢ [M ▹ «N»] : Σ(μ) ⟨ξ ▹ τ⟩ ⇝ ι 0 E

Γᵢ; Γc; Γ ⊢ M : Π(μ) ⟨ξ ▹ τ⟩ ⇝ E
Γᵢ; Γc; Γ ⊢ «N» : ⌊ξ⌋ ⇝ F
──────────────────────────────── unlabelProd
Γᵢ; Γc; Γ ⊢ M/«N» : τ ⇝ π 0 E

Γᵢ; Γc; Γ ⊢ M : Σ(μ) ⟨ξ ▹ τ⟩ ⇝ E
Γᵢ; Γc; Γ ⊢ «N» : ⌊ξ⌋ ⇝ F
Γc; Γ ⊢ τ : * ⇝ A
───────────────────────────────────────────── unlabelSum
Γᵢ; Γc; Γ ⊢ M/«N» : τ ⇝ case E {λ x : A. x$0}

Γᵢ; Γc; Γ ⊢ M : Π(μ) ρ₀ ⇝ E
Γᵢ; Γc; Γ ⊨ ρ₁ ≲(μ) ρ₀ ⇝ F
────────────────────────────────────────────────────── «prj»
Γᵢ; Γc; Γ ⊢ prj M : Π(μ) ρ₁ ⇝ ⦅π 0 F⦆ [λ a : *. a$0] E

Γᵢ; Γc; Γ ⊢ M : Π(μ) ρ₀ ⇝ E₀
Γᵢ; Γc; Γ ⊢ «N» : Π(μ) ρ₁ ⇝ E₁
Γᵢ; Γc; Γ ⊨ ρ₀ ⊙(μ) ρ₁ ~ ρ₂ ⇝ F
─────────────────────────────────────────────────────────────── concat
Γᵢ; Γc; Γ ⊢ M ++ «N» : Π(μ) ρ₂ ⇝ ⦅⦅π 0 F⦆ [λ a : *. a$0] E₀⦆ E₁

Γᵢ; Γc; Γ ⊢ M : Σ(μ) ρ₀ ⇝ E
Γᵢ; Γc; Γ ⊨ ρ₀ ≲(μ) ρ₁ ⇝ F
────────────────────────────────────────────────────── «inj»
Γᵢ; Γc; Γ ⊢ inj M : Σ(μ) ρ₁ ⇝ ⦅π 1 F⦆ [λ a : *. a$0] E

Γᵢ; Γc; Γ ⊢ M : (Σ(μ) ρ₀) → τ ⇝ E₀
Γᵢ; Γc; Γ ⊢ «N» : (Σ(μ) ρ₁) → τ ⇝ E₁
Γᵢ; Γc; Γ ⊨ ρ₀ ⊙(μ) ρ₁ ~ ρ₂ ⇝ F
Γc; Γ ⊢ τ : * ⇝ A
──────────────────────────────────────────────────────────────────────── elim
Γᵢ; Γc; Γ ⊢ M ▿ «N» : (Σ(μ) ρ₂) → τ ⇝ ⦅⦅π 1 F⦆ [λ a : *. a$0] [A] E₀⦆ E₁

Γᵢ; Γc; Γ ⊢ M : τ₀ ⇝ E
Γc; Γ ⊢ τ₀ <: τ₁ ⇝ F
──────────────────────── sub
Γᵢ; Γc; Γ ⊢ M : τ₁ ⇝ F E

(</ TCₛ@i a ⇝ Aₛ@i // i in [:n] /> ⇒ TC a : κ) ↦ m : σ ⇝ A ∈ Γc
Γᵢ; Γc; Γ ⊨ TC τ ⇝ E
─────────────────────────────────────────────────────────────── member {TC}
Γᵢ; Γc; Γ ⊢ m : σ^^τ ⇝ π 0 E

Γᵢ; Γc; Γ ⊢ M : Ξ(C) ρ ⇝ E
────────────────────────────────── «order»
Γᵢ; Γc; Γ ⊢ order ρ M : Ξ(N) ρ ⇝ E

Γc; Γ ⊢ ρ : R κ ⇝ A
∀ a ∉ Iₘ, Γc; Γ, a : R κ ⊢ τ^a : * ⇝ B^a
⊢ κ ⇝ K
∀ aₗ ∉ Iₛ, ∀ aₜ ∉ aₗ :: Iₛ, ∀ aₚ ∉ aₜ :: aₗ :: Iₛ, ∀ aᵢ ∉ aₚ :: aₜ :: aₗ :: Iₛ, ∀ aₙ ∉ aᵢ :: aₚ :: aₜ :: aₗ :: Iₛ, Γᵢ; Γc; Γ, aₗ : L, aₜ : κ, aₚ : R κ, aᵢ : R κ, aₙ : R κ ⊢ M : ⟨aₗ ▹ aₜ⟩ ⊙(N) aₚ ~ aᵢ ⇒ aₙ ⊙(N) aᵢ ~ ρ ⇒ ⌊aₗ⌋ → (τ^^aₚ) → τ^^aᵢ ⇝ E₀^aₗ#4^aₜ#3^aₚ#2^aᵢ#1^aₙ
Γᵢ; Γc; Γ ⊢ «N» : τ^^⟨ : κ ⟩ ⇝ E₁
Γᵢ; Γc; Γ ⊨ Ind ρ ⇝ F
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── «ind» (Iₘ Iₛ : List TypeVarId)
Γᵢ; Γc; Γ ⊢ ind (λ a : R κ. τ) ρ; M; «N» : τ^^ρ ⇝ ⦅F [λ a : L K. B] ⦅Λ aₗ : *. Λ aₜ : K. Λ aₚ : L K. Λ aᵢ : L K. Λ aₙ : L K. E₀⦆⦆ E₁

Γᵢ; Γc; Γ ⊢ M : Π(μ) ρ₂ ⇝ E
Γᵢ; Γc; Γ ⊨ Split (λ a : *. τ) ρ₀ ⊙' ρ₁ ~ ρ₂ ⇝ F
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── «splitₚ»
Γᵢ; Γc; Γ ⊢ splitₚ (λ a : *. τ) M : Π(N) ⟨ℓₘ ▹ Π(μ) Lift (λ a : *. τ) ρ₀, ℓᵣ ▹ Π(μ) ρ₁⟩ ⇝ (⦅π 0 π 2 F⦆ [λ a : *. a$0] E, ⦅π 0 π 3 F⦆ [λ a : *. a$0] E)

Γᵢ; Γc; Γ ⊢ M : (Σ(μ) (Lift (λ a : *. τ₀) ρ₀)) → τ₁ ⇝ E₀
Γᵢ; Γc; Γ ⊢ «N» : (Σ(μ) ρ₁) → τ₁ ⇝ E₁
Γᵢ; Γc; Γ ⊨ Split (λ a : *. τ₀) ρ₀ ⊙' ρ₁ ~ ρ₂ ⇝ F
Γc; Γ ⊢ τ₁ : * ⇝ A
──────────────────────────────────────────────────────────────────────────────────────────── «splitₛ»
Γᵢ; Γc; Γ ⊢ splitₛ (λ a : *. τ) M; «N» : (Σ(μ) ρ₂) → τ₁ ⇝ ⦅⦅π 1 F⦆ [λ a : *. a$0] [A] E₀⦆ E₁

judgement Monotype.ConstraintSolvingAndElaboration :=

end

end TabularTypeInterpreter
