import Lott.DSL.Elab.JudgementComprehension
import Lott.DSL.Elab.OrJudgement
import Lott.DSL.Elab.UniversalJudgement
import TabularTypeInterpreter.Data.Range
import TabularTypeInterpreter.«F⊗⊕ω».Semantics.Type
import TabularTypeInterpreter.Semantics.Kind
import TabularTypeInterpreter.Semantics.TypeEnvironment
import TabularTypeInterpreter.Semantics.ClassEnvironment

namespace TabularTypeInterpreter

judgement_syntax ℓ " ≠ " ℓ' : Label.Ne

def Label.Ne := _root_.Ne (α := Label)

judgement_syntax "unique" "(" sepBy(ξ, ", ") ")" : Monotype.label.Uniqueness

judgement Monotype.label.Uniqueness :=

</ </ ℓ@i ≠ ℓ@j // j in [i + 1:n] /> // i in [:n] />
──────────────────────────────────────────────────── concrete
unique(</ ℓ@i // i in [:n] />)

───────── var
unique(ξ)

open «F⊗⊕ω»

judgement_syntax Γc "; " Γ " ⊢ " σ " : " κ " ⇝ " A : TypeScheme.KindingAndElaboration

judgement_syntax Γc " ⊢ " Γ " ⇝ " Δ : TypeEnvironment.WellFormednessAndElaboration

judgement_syntax "⊢c " Γc : ClassEnvironment.WellFormedness

mutual

judgement TypeScheme.KindingAndElaboration :=

a : κ ∈ Γ
───────────────── var
Γc; Γ ⊢ a : κ ⇝ a

Γc; Γ ⊢ φ : κ₀ ↦ κ₁ ⇝ A
Γc; Γ ⊢ τ : κ₀ ⇝ B
─────────────────────── app
Γc; Γ ⊢ φ τ : κ₁ ⇝ A B

Γc; Γ ⊢ τ₀ : * ⇝ A
Γc; Γ ⊢ τ₁ : * ⇝ B
─────────────────────────── arr
Γc; Γ ⊢ τ₀ → τ₁ : * ⇝ A → B

Γc; Γ ⊢ ψ : C ⇝ A
Γc; Γ ⊢ γ : κ ⇝ B
⊢ κ ⇝ *
───────────────────────── qual
Γc; Γ ⊢ ψ ⇒ γ : κ ⇝ A → B

∀ a ∉ I, Γc; Γ, a : κ₀ ⊢ σ^a : κ₁ ⇝ A^a
⊢ κ₀ ⇝ K₀
─────────────────────────────────────── scheme (I : List TypeVarId)
Γc; Γ ⊢ ∀ a : κ₀. σ : κ₁ ⇝ ∀ a : K₀. A

───────────────────── label
Γc; Γ ⊢ ℓ : L ⇝ ⊗ { }

Γc; Γ ⊢ ξ : L ⇝ A
─────────────────────── floor
Γc; Γ ⊢ ⌊ξ⌋ : * ⇝ ⊗ { }

───────────────────── comm
Γc; Γ ⊢ u : U ⇝ ⊗ { }

</ Γc; Γ ⊢ ξ@i : L ⇝ B@i // i in [:n] />
unique(</ ξ@i // i in [:n] />)
</ Γc; Γ ⊢ τ@i : κ ⇝ A@i // i in [:n] />
n ≠ 0 ∨ b
────────────────────────────────────────────────────────────────────────────────────── row
Γc; Γ ⊢ ⟨</ ξ@i ▹ τ@i // i in [:n] /> </ : κ // b />⟩ : R κ ⇝ {</ A@i // i in [:n] />}

Γc; Γ ⊢ μ : U ⇝ B
Γc; Γ ⊢ ρ : R * ⇝ A
──────────────────────── prod
Γc; Γ ⊢ Π(μ) ρ : * ⇝ ⊗ A

Γc; Γ ⊢ μ : U ⇝ B
Γc; Γ ⊢ ρ : R * ⇝ A
──────────────────────── sum
Γc; Γ ⊢ Σ(μ) ρ : * ⇝ ⊕ A

∀ a ∉ I, Γc; Γ, a : κ₀ ⊢ τ^a : κ₁ ⇝ A^a
⊢ κ₀ ⇝ K₀
Γc; Γ ⊢ ρ : R κ₀ ⇝ B
─────────────────────────────────────────────────────── lift (I : List TypeVarId)
Γc; Γ ⊢ Lift (λ a : κ₀. τ) ρ : R κ₁ ⇝ (λ a : K₀. A) ⟦B⟧

Γc; Γ ⊢ μ : U ⇝ B
Γc; Γ ⊢ ρ₀ : R κ ⇝ A₀
Γc; Γ ⊢ ρ₁ : R κ ⇝ A₁
⊢ κ ⇝ K
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────── contain
Γc; Γ ⊢ ρ₀ ≲(μ) ρ₁ : C ⇝ ⊗ {∀ a : K ↦ *. (⊗ (a$0 ⟦A₁⟧)) → ⊗ (a$0 ⟦A₀⟧), ∀ a : K ↦ *. (⊕ (a$0 ⟦A₀⟧)) → ⊕ (a$0 ⟦A₁⟧)}

Γc; Γ ⊢ μ : U ⇝ B
Γc; Γ ⊢ ρ₀ : R κ ⇝ A₀
Γc; Γ ⊢ ρ₁ : R κ ⇝ A₁
Γc; Γ ⊢ ρ₂ : R κ ⇝ A₂
⊢ κ ⇝ K
Γc; Γ ⊢ ρ₀ ≲(μ) ρ₂ : C ⇝ Bₗ
Γc; Γ ⊢ ρ₁ ≲(μ) ρ₂ : C ⇝ Bᵣ
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── concat
Γc; Γ ⊢ ρ₀ ⊙(μ) ρ₁ ~ ρ₂ : C ⇝ ⊗ {∀ a : K ↦ *. (⊗ (a$0 ⟦A₀⟧)) → (⊗ (a$0 ⟦A₁⟧)) → ⊗ (a$0 ⟦A₂⟧), ∀ a : K ↦ *. ∀ aₜ : *. ((⊕ (a$1 ⟦A₀⟧)) → aₜ$0) → ((⊕ (a$1 ⟦A₁⟧)) → aₜ$0) → (⊕ (a$1 ⟦A₂⟧)) → aₜ$0, Bₗ, Bᵣ}

⊢c Γc
(</ TCₛ@i a ⇝ Aₛ@i // i in [:n] /> ⇒ TC a : κ) ↦ m : σ ⇝ A ∈ Γc
Γc; Γ ⊢ τ : κ ⇝ B
─────────────────────────────────────────────────────────────── tc {TC}
Γc; Γ ⊢ TC τ : C ⇝ ⊗ {A^^B, </ Aₛ@i^^B // i in [:n] />}

∀ a ∉ I, Γc; Γ, a : κ ⊢ ψ^a : C ⇝ A^a
⊢ κ ⇝ K
Γc; Γ ⊢ ρ : R κ ⇝ B
───────────────────────────────────────────────────── all (I : List TypeVarId)
Γc; Γ ⊢ All (λ a : κ. ψ) ρ : C ⇝ ⊗ ((λ a : K. A) ⟦B⟧)

Γc; Γ ⊢ ρ : R κ ⇝ A
⊢ κ ⇝ K
∀ aₗ ∉ I₀, ∀ aₜ ∉ aₗ :: I₀, ∀ aₚ ∉ aₜ :: aₗ :: I₀, ∀ aᵢ ∉ aₚ :: aₜ :: aₗ :: I₀, ∀ aₙ ∉ aᵢ :: aₚ :: aₜ :: aₗ :: I₀, Γc; Γ, aₗ : L, aₜ : κ, aₚ : R κ, aᵢ : R κ, aₙ : R κ ⊢ ⟨aₗ ▹ aₜ⟩ ⊙(N) aₚ ~ aᵢ : C ⇝ Bᵣ^aₙ^aᵢ^aₚ^aₜ^aₗ
∀ aᵢ ∉ I₁, ∀ aₙ ∉ aᵢ :: I₁, Γc; Γ, aᵢ : R κ, aₙ : R κ ⊢ aᵢ ⊙(N) aₙ ~ ρ : C ⇝ Bₗ^aₙ^aᵢ
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── «ind» (I₀ I₁)
Γc; Γ ⊢ Ind ρ : C ⇝ ∀ aₘ : (L K) ↦ *. (∀ aₗ : *. ∀ aₜ : K. ∀ aₚ : L K. ∀ aᵢ : L K. ∀ aₙ : L K. Bᵣ → Bₗ → aₗ$4 → aₘ$5 aₚ$2 → aₘ$5 aₙ$0) → aₘ$5 { } → aₘ$5 A

Γc; Γ ⊢ (Lift (λ a : *. τ) ρ₀) ⊙(C) ρ₁ ~ ρ₂ : C ⇝ A
─────────────────────────────────────────────────── split
Γc; Γ ⊢ Split (λ a : *. τ) ρ₀ ⊙' ρ₁ ~ ρ₂ : C ⇝ A

judgement TypeEnvironment.WellFormednessAndElaboration :=

────────── empty
Γc ⊢ ε ⇝ ε

Γc ⊢ Γ ⇝ Δ
a ∉ dom(Γ)
⊢ κ ⇝ K
──────────────────────── typeExt
Γc ⊢ Γ, a : κ ⇝ Δ, a : K

Γc ⊢ Γ ⇝ Δ
x ∉ dom'(Γ)
Γc; Γ ⊢ σ : * ⇝ A
──────────────────────── termExt
Γc ⊢ Γ, x : σ ⇝ Δ, x : A

Γc ⊢ Γ ⇝ Δ
x ∉ dom'(Γ)
Γc; Γ ⊢ ψ : C ⇝ A
──────────────────────── constrExt
Γc ⊢ Γ, ψ ⇝ x ⇝ Δ, x : A

judgement ClassEnvironment.WellFormedness :=

──── empty
⊢c ε

⊢c Γc
TC ∉ dom(Γc)
m ∉ dom(Γc)
⊢ κ ⇝ K
∀ a, Γc; ε, a : κ ⊢ σ^a : * ⇝ A^a
∀ a, ε, a : K ⊢ A^a : *
</ ∀ a, Γc; ε, a : κ ⊢ TCₛ@i a : C ⇝ Aₛ@i^a // i in [:n] />
</ ∀ a, ε, a : K ⊢ Aₛ@i^a : * // i in [:n] />
───────────────────────────────────────────────────────────────── ext {TC}
⊢c Γc, (</ TCₛ@i a ⇝ Aₛ@i // i in [:n] /> ⇒ TC a : κ) ↦ m : σ ⇝ A

end

judgement_syntax Γc "; " Γ " ⊢ " ρ₀ " ≡" "(" μ ") " ρ₁ " ⇝ " Fₚ ", " Fₛ : Monotype.RowEquivalenceAndElaboration

judgement Monotype.RowEquivalenceAndElaboration :=

Γc; Γ ⊢ ρ : R κ ⇝ A
⊢ κ ⇝ K
─────────────────────────────────────────────────────────────────────────────────────────── refl
Γc; Γ ⊢ ρ ≡(μ) ρ ⇝ Λ a : K ↦ *. λ x : ⊗ (a$0 ⟦A⟧). x$0, Λ a : K ↦ *. λ x : ⊕ (a$0 ⟦A⟧). x$0

/-
symm is not included directly as a rule because the elaboration functions are directional (they
convert from an elaborated prod or sum of the lhs to the same of the rhs), so a symm rule would have
to magically find the inverse function term based on the original direction. Instead, we include a
lemma proving symmetry in ../../Lemmas/Type.lean.
-/

Γc; Γ ⊢ ρ₀ : R κ ⇝ A₀
⊢ κ ⇝ K
Γc; Γ ⊢ ρ₀ ≡(μ) ρ₁ ⇝ Fₚ₀₁, Fₛ₀₁
Γc; Γ ⊢ ρ₁ ≡(μ) ρ₂ ⇝ Fₚ₁₂, Fₛ₁₂
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── trans
Γc; Γ ⊢ ρ₀ ≡(μ) ρ₂ ⇝ Λ a : K ↦ *. λ x : ⊗ (a$0 ⟦A₀⟧). Fₚ₁₂ [a$0] ⦅Fₚ₀₁ [a$0] x$0⦆, Λ a : K ↦ *. λ x : ⊕ (a$0 ⟦A₀⟧). Fₛ₁₂ [a$0] ⦅Fₛ₀₁ [a$0] x$0⦆

-- TODO: Add comment to latex output to explain relationship between [:n], p, and p'.
Γc; Γ ⊢ ⟨</ ξ@i ▹ τ@i // i in [:n] /> </ : κ // b />⟩ : R κ ⇝ {</ A@i // i in [:n] />}
⊢ κ ⇝ K
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── comm {p p' : List Nat} (perm : List.Perm p [:n]) (perm' : List.Perm p' [:n]) (inv : Std.Range.get!InverseOn p p' n)
Γc; Γ ⊢ ⟨</ ξ@i ▹ τ@i // i in [:n] /> </ : κ // b />⟩ ≡(C) ⟨</ ξ@i ▹ τ@i // i in p /> </ : κ // b />⟩ ⇝ Λ a : K ↦ *. λ x : ⊗ (a$0 ⟦{</ A@i // i in [:n] />}⟧). (</ π n' x$0 // n' in p />), Λ a : K ↦ *. λ x : ⊕ (a$0 ⟦{</ A@i // i in [:n] />}⟧). case x$0 {</ λ x' : a$0 A@i. ι n' x'$0 // (i, n') in [:n].toList.zip p' />}

Γc; Γ ⊢ Lift (λ a : κ₀. τ₁) ⟨</ ξ@i ▹ τ₀@i // i in [:n] /> </ : κ₀ // b />⟩ : R κ₁ ⇝ A
⊢ κ₁ ⇝ K
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── liftL (μ)
Γc; Γ ⊢ Lift (λ a : κ₀. τ₁) ⟨</ ξ@i ▹ τ₀@i // i in [:n] /> </ : κ₀ // b />⟩ ≡(μ) ⟨</ ξ@i ▹ τ₁^^τ₀@i // i in [:n] /> </ : κ₁ // b />⟩ ⇝ Λ a : K ↦ *. λ x : ⊗ (a$0 ⟦A⟧). x$0, Λ a : K ↦ *. λ x : ⊕ (a$0 ⟦A⟧). x$0

Γc; Γ ⊢ Lift (λ a : κ₀. τ₁) ⟨</ ξ@i ▹ τ₀@i // i in [:n] /> </ : κ₀ // b />⟩ : R κ₁ ⇝ A
⊢ κ₁ ⇝ K
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── liftR (μ)
Γc; Γ ⊢ ⟨</ ξ@i ▹ τ₁^^τ₀@i // i in [:n] /> </ : κ₁ // b />⟩ ≡(μ) Lift (λ a : κ₀. τ₁) ⟨</ ξ@i ▹ τ₀@i // i in [:n] /> </ : κ₀ // b />⟩ ⇝ Λ a : K ↦ *. λ x : ⊗ (a$0 ⟦A⟧). x$0, Λ a : K ↦ *. λ x : ⊕ (a$0 ⟦A⟧). x$0

judgement_syntax Γc "; " Γ " ⊢ " σ₀ " ≡ " σ₁ " ⇝ " F : TypeScheme.EquivalenceAndElaboration

judgement TypeScheme.EquivalenceAndElaboration :=

Γc; Γ ⊢ σ : κ ⇝ A
──────────────────────────── refl
Γc; Γ ⊢ σ ≡ σ ⇝ λ x : A. x$0

-- TODO: is it OK to not have app? This seems impossible given the elaboration requirement...

Γc; Γ ⊢ τ₂ ≡ τ₀ ⇝ E
Γc; Γ ⊢ τ₁ ≡ τ₃ ⇝ F
Γc; Γ ⊢ τ₀ → τ₁ : * ⇝ A
Γc; Γ ⊢ τ₂ : * ⇝ B
─────────────────────────────────────────────────────────────── arr
Γc; Γ ⊢ τ₀ → τ₁ ≡ τ₂ → τ₃ ⇝ λ x : A. λ xₐ : B. F ⦅x$1 ⦅E xₐ$0⦆⦆

Γc; Γ ⊢ ψ₁ ≡ ψ₀ ⇝ E
Γc; Γ ⊢ γ₀ ≡ γ₁ ⇝ F
Γc; Γ ⊢ ψ₀ ⇒ γ₀ : κ ⇝ A
Γc; Γ ⊢ ψ₁ : C ⇝ B
─────────────────────────────────────────────────────────────── qual
Γc; Γ ⊢ ψ₀ ⇒ γ₀ ≡ ψ₁ ⇒ γ₁ ⇝ λ x : A. λ xₐ : B. F ⦅xₘ$1 ⦅E x$0⦆⦆

∀ a ∉ I, Γc; Γ, a : κ₀ ⊢ σ₀^a ≡ σ₁^a ⇝ F^a
⊢ κ₀ ⇝ K₀
Γc; Γ ⊢ ∀ a : κ₀. σ₀ : κ₁ ⇝ A
────────────────────────────────────────────────────────────────────── scheme (I : List TypeVarId)
Γc; Γ ⊢ ∀ a : κ₀. σ₀ ≡ ∀ a : κ₀. σ₁ ⇝ λ x : A. Λ a : K₀. F ⦅x$0 [a$0]⦆

</ Γc; Γ ⊢ τ₀@i ≡ τ₁@i ⇝ F@i // i in [:n] />
Γc; Γ ⊢ Π(μ) ⟨</ ξ@i ▹ τ₀@i // i in [:n] /> </ : * // b />⟩ : * ⇝ A
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── prod
Γc; Γ ⊢ Π(μ) ⟨</ ξ@i ▹ τ₀@i // i in [:n] /> </ : * // b />⟩ ≡ Π(μ) ⟨</ ξ@i ▹ τ₁@i // i in [:n] /> </ : * // b />⟩ ⇝ λ x : A. (</ F@n' π n' x$0 // n' in [:n] />)

</ Γc; Γ ⊢ τ₀@i ≡ τ₁@i ⇝ F@i // i in [:n] />
Γc; Γ ⊢ Σ(μ) ⟨</ ξ@i ▹ τ₀@i // i in [:n] /> </ : * // b />⟩ : * ⇝ A
</ Γc; Γ ⊢ τ₀@i : * ⇝ B@i // i in [:n] />
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── sum
Γc; Γ ⊢ Σ(μ) ⟨</ ξ@i ▹ τ₀@i // i in [:n] /> </ : * // b />⟩ ≡ Σ(μ) ⟨</ ξ@i ▹ τ₁@i // i in [:n] /> </ : * // b />⟩ ⇝ λ x : A. case x$0 {</ λ x' : B@n'. ι n' ⦅F@n' x'$0⦆ // n' in [:n] />}

Γc; Γ ⊢ ρ₀ ≡(μ) ρ₁ ⇝ Fₚ, Fₛ
Γc; Γ ⊢ Π(μ) ρ₀ : * ⇝ A
───────────────────────────────────────────── prodRow
Γc; Γ ⊢ Π(μ) ρ₀ ≡ Π(μ) ρ₁ ⇝ Fₚ [λ a : *. a$0]

Γc; Γ ⊢ ρ₀ ≡(μ) ρ₁ ⇝ Fₚ, Fₛ
Γc; Γ ⊢ Σ(μ) ρ₀ : * ⇝ A
───────────────────────────────────────────── sumRow
Γc; Γ ⊢ Σ(μ) ρ₀ ≡ Σ(μ) ρ₁ ⇝ Fₛ [λ a : *. a$0]

Γc; Γ ⊢ ρ₀ ≡(μ) ρ₂ ⇝ F₀₂ₚ, F₀₂ₛ
Γc; Γ ⊢ ρ₁ ≡(μ) ρ₃ ⇝ F₁₃ₚ, F₁₃ₛ
Γc; Γ ⊢ ρ₂ ≡(μ) ρ₀ ⇝ F₂₀ₚ, F₂₀ₛ
Γc; Γ ⊢ ρ₃ ≡(μ) ρ₁ ⇝ F₃₁ₚ, F₃₁ₛ
Γc; Γ ⊢ ρ₀ ≲(μ) ρ₁ : C ⇝ A
Γc; Γ ⊢ ρ₀ : R κ ⇝ A₀
Γc; Γ ⊢ ρ₁ : R κ ⇝ A₁
Γc; Γ ⊢ ρ₂ : R κ ⇝ A₂
Γc; Γ ⊢ ρ₃ : R κ ⇝ A₃
⊢ κ ⇝ K
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── contain
Γc; Γ ⊢ ρ₀ ≲(μ) ρ₁ ≡ ρ₂ ≲(μ) ρ₃ ⇝ λ xₑ : A. (Λ a : K ↦ *. λ x : ⊗ (a$0 ⟦A₃⟧). F₀₂ₚ [a$0] ⦅⦅π 0 xₑ$1⦆ [a$0] ⦅F₃₁ₚ [a$0] x$0⦆⦆, Λ a : K ↦ *. λ x : ⊕ (a$0 ⟦A₂⟧). F₁₃ₛ [a$0] ⦅⦅π 1 xₑ$1⦆ [a$0] ⦅F₂₀ₛ [a$0] x$0⦆⦆)

Γc; Γ ⊢ ρ₀ ≡(μ) ρ₃ ⇝ F₀₃ₚ, F₀₃ₛ
Γc; Γ ⊢ ρ₁ ≡(μ) ρ₄ ⇝ F₁₄ₚ, F₁₄ₛ
Γc; Γ ⊢ ρ₂ ≡(μ) ρ₅ ⇝ F₂₅ₚ, F₂₅ₛ
Γc; Γ ⊢ ρ₃ ≡(μ) ρ₀ ⇝ F₃₀ₚ, F₃₀ₛ
Γc; Γ ⊢ ρ₄ ≡(μ) ρ₁ ⇝ F₄₁ₚ, F₄₁ₛ
Γc; Γ ⊢ ρ₅ ≡(μ) ρ₂ ⇝ F₅₂ₚ, F₅₂ₛ
Γc; Γ ⊢ ρ₀ ⊙(μ) ρ₁ ~ ρ₂ : C ⇝ A
Γc; Γ ⊢ ρ₀ : R κ ⇝ A₀
Γc; Γ ⊢ ρ₁ : R κ ⇝ A₁
Γc; Γ ⊢ ρ₂ : R κ ⇝ A₂
Γc; Γ ⊢ ρ₃ : R κ ⇝ A₃
Γc; Γ ⊢ ρ₄ : R κ ⇝ A₄
Γc; Γ ⊢ ρ₅ : R κ ⇝ A₅
⊢ κ ⇝ K
Γc; Γ ⊢ ρ₀ ≲(μ) ρ₂ ≡ ρ₃ ≲(μ) ρ₅ ⇝ F₀₂₃₅
Γc; Γ ⊢ ρ₁ ≲(μ) ρ₂ ≡ ρ₄ ≲(μ) ρ₅ ⇝ F₁₂₄₅
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── concat
Γc; Γ ⊢ ρ₀ ⊙(μ) ρ₁ ~ ρ₂ ≡ ρ₃ ⊙(μ) ρ₄ ~ ρ₅ ⇝ λ xₑ : A. (Λ a : K ↦ *. λ xₗ : ⊗ (a$0 ⟦A₃⟧). λ xᵣ : ⊗ (a$0 ⟦A₄⟧). F₂₅ₚ [a$0] ⦅⦅⦅π 0 xₑ$2⦆ [a$0] ⦅F₃₀ₚ [a$0] xₗ$1⦆⦆ ⦅F₄₁ₚ [a$0] xᵣ$0⦆⦆, Λ a : K ↦ *. Λ aₜ : *. λ xₗ : (⊕ (a$1 ⟦A₃⟧)) → aₜ$0 . λ xᵣ : (⊕ (a$1 ⟦A₄⟧)) → aₜ$0 . λ x : ⊕ (a$1 ⟦A₅⟧). ⦅⦅⦅π 1 xₑ$3⦆ [a$1] [aₜ$0] ⦅λ xₗ' : ⊕ (a$1 ⟦A₀⟧). xₗ$3 ⦅F₀₃ₛ [a$1] xₗ'$0⦆⦆⦆ ⦅λ xᵣ' : ⊕ (a$1 ⟦A₁⟧). xᵣ$2 ⦅F₁₄ₛ [a$1] xᵣ'$0⦆⦆⦆ ⦅F₅₂ₛ [a$1] x$0⦆, F₀₂₃₅ ⦅π 2 xₑ$0⦆, F₁₂₄₅ ⦅π 3 xₑ$0⦆)

/-
NOTE: The evidence of this first hypothesis isn't actually used, it's just present to prevent
unexpected behaviour.
-/
Γc; Γ ⊢ τ₀ ≡ τ₁ ⇝ E
Γc; Γ ⊢ σ^^τ₀ ≡ σ^^τ₁ ⇝ F
(</ TCₛ@i a ⇝ Aₛ@i // i in [:n] /> ⇒ TC a : κ) ↦ m : σ ⇝ B ∈ Γc
</ Γc; Γ ⊢ TCₛ@i τ₀ ≡ TCₛ@i τ₁ ⇝ Fₛ@i // i in [:n] />
Γc; Γ ⊢ TC τ₀ : C ⇝ A
─────────────────────────────────────────────────────────────────────────────────── tc {TC}
Γc; Γ ⊢ TC τ₀ ≡ TC τ₁ ⇝ λ x : A. (F π 0 x$0, </ Fₛ@i π (i + 1) x$0 // i in [:n] />)

/-
NOTE: The evidence of this first hypothesis isn't actually used, it's just present to prevent
unexpected behaviour. We allow C commutativity since the second hypothesis will still block things
if the method uses them non-commutatively.
-/
Γc; Γ ⊢ ρ₀ ≡(C) ρ₁ ⇝ Eₚ, Eₛ
Γc; Γ ⊢ σ^^ρ₀ ≡ σ^^ρ₁ ⇝ F
(</ TCₛ@i a ⇝ Aₛ@i // i in [:n] /> ⇒ TC a : κ) ↦ m : σ ⇝ B ∈ Γc
</ Γc; Γ ⊢ TCₛ@i ρ₀ ≡ TCₛ@i ρ₁ ⇝ Fₛ@i // i in [:n] />
Γc; Γ ⊢ TC ρ₀ : C ⇝ A
─────────────────────────────────────────────────────────────────────────────────── tcRow {TC}
Γc; Γ ⊢ TC ρ₀ ≡ TC ρ₁ ⇝ λ x : A. (F π 0 x$0, </ Fₛ@i π (i + 1) x$0 // i in [:n] />)

Γc; Γ ⊢ ρ₀ ≡(C) ρ₁ ⇝ Fₚ, Fₛ
Γc; Γ ⊢ All (λ a : κ. ψ) ρ₀ : C ⇝ A
∀ a ∉ I, Γc; Γ, a : κ ⊢ ψ^a : C ⇝ B^a
⊢ κ ⇝ K
─────────────────────────────────────────────────────────────────── allRow (I : List TypeVarId)
Γc; Γ ⊢ All (λ a : κ. ψ) ρ₀ ≡ All (λ a : κ. ψ) ρ₁ ⇝ Fₚ [λ a : K. B]

Γc; Γ ⊢ (Lift (λ a : *. τ) ρ₀) ⊙(C) ρ₁ ~ ρ₂ ≡ (Lift (λ a : *. τ) ρ₃) ⊙(C) ρ₄ ~ ρ₅ ⇝ F
───────────────────────────────────────────────────────────────────────────────────── split
Γc; Γ ⊢ Split (λ a : *. τ) ρ₀ ⊙' ρ₁ ~ ρ₂ ≡ Split (λ a : *. τ) ρ₃ ⊙' ρ₄ ~ ρ₅ ⇝ F

-- TODO: Can we equiv on the types within lambdas?
-- TODO: Are there any other cases we've missed?

end TabularTypeInterpreter
